ansible_cucm/cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addResourcePriorityNamespaceList.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addResourcePriorityNamespaceList sequence="?">
         <resourcePriorityNamespaceList>
            <name>dsn</name>
            <description>Defense Switched Network</description>
            <members>
               <!--1 or more repetitions:-->
               <member>
                  <resourcePriorityNamespaceName uuid="?">dsn-000000</resourcePriorityNamespaceName>
                  <index>1</index>
               </member>
            </members>
         </resourcePriorityNamespaceList>
      </ns:addResourcePriorityNamespaceList>
   </soapenv:Body>
</soapenv:Envelope>

